experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run2_vclients24_workerthreads64_client3_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      150621 ops,    2326 (avg:    2151) ops/sec, 9.17MB/sec (avg: 8.48MB/sec), 10.41 (avg: 11.15) msec latency

1         Threads
24        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2151.64          ---          ---     11.15000      8684.06 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2151.64         0.00         0.00     11.15000      8684.06 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.770         0.00
SET       0.880         0.00
SET       0.900         0.00
SET       0.910         0.00
SET       0.920         0.00
SET       0.930         0.00
SET       0.970         0.01
SET       1.000         0.01
SET       1.100         0.02
SET       1.200         0.05
SET       1.300         0.09
SET       1.400         0.15
SET       1.500         0.24
SET       1.600         0.36
SET       1.700         0.52
SET       1.800         0.71
SET       1.900         0.95
SET       2.000         1.19
SET       2.100         1.42
SET       2.200         1.68
SET       2.300         1.92
SET       2.400         2.15
SET       2.500         2.44
SET       2.600         2.72
SET       2.700         2.96
SET       2.800         3.21
SET       2.900         3.46
SET       3.000         3.70
SET       3.100         3.98
SET       3.200         4.23
SET       3.300         4.51
SET       3.400         4.80
SET       3.500         5.09
SET       3.600         5.39
SET       3.700         5.66
SET       3.800         5.96
SET       3.900         6.20
SET       4.000         6.46
SET       4.100         6.73
SET       4.200         7.00
SET       4.300         7.27
SET       4.400         7.56
SET       4.500         7.83
SET       4.600         8.10
SET       4.700         8.36
SET       4.800         8.63
SET       4.900         8.93
SET       5.000         9.20
SET       5.100         9.44
SET       5.200         9.71
SET       5.300         9.97
SET       5.400        10.25
SET       5.500        10.55
SET       5.600        10.83
SET       5.700        11.12
SET       5.800        11.41
SET       5.900        11.69
SET       6.000        12.04
SET       6.100        12.34
SET       6.200        12.65
SET       6.300        12.99
SET       6.400        13.33
SET       6.500        13.66
SET       6.600        14.02
SET       6.700        14.38
SET       6.800        14.77
SET       6.900        15.13
SET       7.000        15.55
SET       7.100        15.95
SET       7.200        16.36
SET       7.300        16.79
SET       7.400        17.24
SET       7.500        17.75
SET       7.600        18.29
SET       7.700        18.83
SET       7.800        19.38
SET       7.900        20.00
SET       8.000        20.66
SET       8.100        21.36
SET       8.200        22.06
SET       8.300        22.82
SET       8.400        23.62
SET       8.500        24.44
SET       8.600        25.32
SET       8.700        26.29
SET       8.800        27.33
SET       8.900        28.46
SET       9.000        29.65
SET       9.100        30.87
SET       9.200        32.15
SET       9.300        33.52
SET       9.400        34.91
SET       9.500        36.41
SET       9.600        38.04
SET       9.700        39.74
SET       9.800        41.64
SET       9.900        43.60
SET      10.000        51.92
SET      11.000        62.11
SET      12.000        69.67
SET      13.000        75.83
SET      14.000        81.16
SET      15.000        85.51
SET      16.000        89.03
SET      17.000        91.74
SET      18.000        93.68
SET      19.000        95.08
SET      20.000        96.43
SET      21.000        97.06
SET      22.000        97.58
SET      23.000        97.99
SET      24.000        98.31
SET      25.000        98.56
SET      26.000        98.78
SET      27.000        98.93
SET      28.000        99.04
SET      29.000        99.13
SET      30.000        99.21
SET      31.000        99.28
SET      32.000        99.34
SET      33.000        99.39
SET      34.000        99.45
SET      35.000        99.50
SET      36.000        99.56
SET      37.000        99.61
SET      38.000        99.67
SET      39.000        99.71
SET      40.000        99.75
SET      41.000        99.79
SET      42.000        99.82
SET      43.000        99.84
SET      44.000        99.86
SET      45.000        99.89
SET      46.000        99.90
SET      47.000        99.91
SET      48.000        99.92
SET      49.000        99.93
SET      50.000        99.94
SET      51.000        99.94
SET      52.000        99.95
SET      53.000        99.96
SET      54.000        99.96
SET      55.000        99.96
SET      56.000        99.96
SET      57.000        99.97
SET      58.000        99.97
SET      59.000        99.97
SET      60.000        99.98
SET      61.000        99.98
SET      62.000        99.98
SET      63.000        99.98
SET      64.000        99.98
SET      65.000        99.98
SET     180.000        99.99
SET     190.000       100.00
SET     200.000       100.00
---
---