experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run2_vclients32_workerthreads8_client3_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       87509 ops,    1202 (avg:    1249) ops/sec, 4.74MB/sec (avg: 4.93MB/sec), 25.90 (avg: 25.60) msec latency

1         Threads
32        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1232.01          ---          ---     25.60300      4972.44 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1232.01         0.00         0.00     25.60300      4972.44 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       6.600         0.00
SET       7.300         0.00
SET       8.100         0.00
SET       8.200         0.00
SET       8.400         0.01
SET       8.500         0.01
SET       8.800         0.01
SET       8.900         0.01
SET       9.000         0.02
SET       9.100         0.02
SET       9.200         0.03
SET       9.300         0.03
SET       9.400         0.03
SET       9.500         0.04
SET       9.600         0.05
SET       9.700         0.06
SET       9.800         0.07
SET       9.900         0.08
SET      10.000         0.13
SET      11.000         0.33
SET      12.000         0.70
SET      13.000         1.31
SET      14.000         2.22
SET      15.000         3.92
SET      16.000         6.44
SET      17.000         9.81
SET      18.000        13.92
SET      19.000        18.75
SET      20.000        24.28
SET      21.000        30.52
SET      22.000        37.24
SET      23.000        43.91
SET      24.000        50.03
SET      25.000        56.04
SET      26.000        62.12
SET      27.000        68.05
SET      28.000        74.03
SET      29.000        79.01
SET      30.000        83.30
SET      31.000        86.30
SET      32.000        88.64
SET      33.000        90.51
SET      34.000        92.11
SET      35.000        93.36
SET      36.000        94.48
SET      37.000        95.51
SET      38.000        96.20
SET      39.000        96.68
SET      40.000        97.10
SET      41.000        97.42
SET      42.000        97.66
SET      43.000        97.89
SET      44.000        98.10
SET      45.000        98.26
SET      46.000        98.46
SET      47.000        98.60
SET      48.000        98.72
SET      49.000        98.85
SET      50.000        98.95
SET      51.000        99.04
SET      52.000        99.12
SET      53.000        99.20
SET      54.000        99.26
SET      55.000        99.32
SET      56.000        99.36
SET      57.000        99.42
SET      58.000        99.47
SET      59.000        99.51
SET      60.000        99.53
SET      61.000        99.55
SET      62.000        99.56
SET      63.000        99.57
SET      64.000        99.59
SET      65.000        99.60
SET      66.000        99.62
SET      67.000        99.64
SET      68.000        99.66
SET      69.000        99.66
SET      70.000        99.67
SET      71.000        99.68
SET      72.000        99.69
SET      73.000        99.70
SET      74.000        99.71
SET      75.000        99.72
SET      76.000        99.73
SET      77.000        99.75
SET      78.000        99.75
SET      79.000        99.76
SET      80.000        99.77
SET      81.000        99.77
SET      82.000        99.78
SET      85.000        99.78
SET      86.000        99.78
SET      89.000        99.78
SET      90.000        99.79
SET      92.000        99.79
SET      93.000        99.79
SET      94.000        99.79
SET      95.000        99.79
SET      96.000        99.80
SET      97.000        99.80
SET     110.000        99.81
SET     130.000        99.83
SET     140.000        99.83
SET     160.000        99.85
SET     170.000        99.88
SET     180.000        99.89
SET     190.000        99.90
SET     220.000        99.93
SET     230.000        99.94
SET     250.000        99.94
SET     270.000        99.97
SET     280.000        99.99
SET     390.000        99.99
SET     400.000       100.00
---
---