experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run3_vclients16_workerthreads16_client2_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      111313 ops,    1420 (avg:    1590) ops/sec, 5.60MB/sec (avg: 6.27MB/sec), 11.32 (avg: 10.06) msec latency

1         Threads
16        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1590.10          ---          ---     10.05800      6417.67 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1590.10         0.00         0.00     10.05800      6417.67 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.100         0.00
SET       1.200         0.01
SET       1.300         0.01
SET       1.400         0.03
SET       1.500         0.04
SET       1.600         0.06
SET       1.700         0.08
SET       1.800         0.11
SET       1.900         0.14
SET       2.000         0.18
SET       2.100         0.23
SET       2.200         0.30
SET       2.300         0.37
SET       2.400         0.49
SET       2.500         0.63
SET       2.600         0.87
SET       2.700         1.18
SET       2.800         1.59
SET       2.900         2.09
SET       3.000         2.65
SET       3.100         3.35
SET       3.200         4.09
SET       3.300         4.80
SET       3.400         5.62
SET       3.500         6.44
SET       3.600         7.18
SET       3.700         7.92
SET       3.800         8.66
SET       3.900         9.31
SET       4.000         9.96
SET       4.100        10.55
SET       4.200        11.12
SET       4.300        11.67
SET       4.400        12.20
SET       4.500        12.68
SET       4.600        13.18
SET       4.700        13.72
SET       4.800        14.23
SET       4.900        14.72
SET       5.000        15.22
SET       5.100        15.69
SET       5.200        16.11
SET       5.300        16.54
SET       5.400        16.96
SET       5.500        17.38
SET       5.600        17.79
SET       5.700        18.20
SET       5.800        18.64
SET       5.900        19.08
SET       6.000        19.49
SET       6.100        19.96
SET       6.200        20.37
SET       6.300        20.80
SET       6.400        21.26
SET       6.500        21.71
SET       6.600        22.15
SET       6.700        22.60
SET       6.800        23.10
SET       6.900        23.60
SET       7.000        24.10
SET       7.100        24.58
SET       7.200        25.08
SET       7.300        25.60
SET       7.400        26.10
SET       7.500        26.63
SET       7.600        27.19
SET       7.700        27.76
SET       7.800        28.38
SET       7.900        29.09
SET       8.000        29.81
SET       8.100        30.52
SET       8.200        31.28
SET       8.300        32.01
SET       8.400        32.82
SET       8.500        33.61
SET       8.600        34.50
SET       8.700        35.32
SET       8.800        36.14
SET       8.900        36.98
SET       9.000        37.85
SET       9.100        38.79
SET       9.200        39.71
SET       9.300        40.70
SET       9.400        41.77
SET       9.500        42.88
SET       9.600        44.19
SET       9.700        45.55
SET       9.800        47.08
SET       9.900        48.77
SET      10.000        57.12
SET      11.000        68.22
SET      12.000        75.93
SET      13.000        81.90
SET      14.000        87.01
SET      15.000        91.01
SET      16.000        93.92
SET      17.000        96.14
SET      18.000        97.52
SET      19.000        98.12
SET      20.000        98.56
SET      21.000        98.78
SET      22.000        98.95
SET      23.000        99.08
SET      24.000        99.20
SET      25.000        99.29
SET      26.000        99.37
SET      27.000        99.44
SET      28.000        99.52
SET      29.000        99.58
SET      30.000        99.64
SET      31.000        99.71
SET      32.000        99.75
SET      33.000        99.78
SET      34.000        99.80
SET      35.000        99.83
SET      36.000        99.86
SET      37.000        99.89
SET      38.000        99.92
SET      39.000        99.93
SET      40.000        99.95
SET      41.000        99.96
SET      43.000        99.96
SET      45.000        99.97
SET      46.000        99.97
SET      47.000        99.97
SET      48.000        99.97
SET      49.000        99.98
SET      50.000        99.98
SET      51.000        99.98
SET      53.000        99.98
SET      55.000        99.98
SET      56.000        99.98
SET      60.000        99.98
SET      61.000        99.99
SET     160.000        99.99
SET     170.000        99.99
SET     190.000        99.99
SET     220.000       100.00
SET     230.000       100.00
---
---